# 1. iris 데이터를 이용하여 CART 기법 적용(rpart()함수 이용)하여 분류분석 하시오.
#
# (1) 데이터 가져오기 & 샘플링
# (2) 분류모델 생성
# (3) 테스트 데이터를 이용하여 분류
# (4) 예측정확도
#
# (의사결정나무 – 조건부 추론나무)
# 2. iris 데이터를 이용하여 조건부 추론나무 적용(ctree()함수 이용)하여 분류분석 하시오.
# (1) 데이터 가져오기 & 샘플링
# (2) 분류모델 생성
# (3) 테스트 데이터를 이용하여 분류
# (4) 시각화
#
# (계층적 군집분석)
# 3. iris데이터 셋의 1~4번 변수를 대상으로 유클리드 거리 매트릭스를 구하여 idist에 저장한 후 계층적 클러스터링을 적용하여 결과를 시각화하시오.
# (1) 유클리드 거리 계산
# (2) 계층형 군집 분석(클러스터링)
# (3) 분류결과를 대상으로 음수값을 제거하여 덴드로그램 시각화
# (4) 그룹 수를 3개로 지정하여 그룹별로 테두리 표시
#
# (K-Means 군집분석)
# 4. iris데이터에서 species 컬럼 데이터를 제거한 후 k-means clustering를 다음 단계별로 실행하시오
# (1) iris 데이터셋 로딩
# (2) species 데이터 제거
# (3) k-means clustering 실행
# (4) 군집 결과 시각화
